In [1]:
#Like values, we can also modify the index labels using mapping
import pandas as pd
from pandas import DataFrame, Series
import numpy as np

In [2]:
#Consider a dataframe

data = DataFrame(np.arange(12).reshape(3,4), index=list('abc'), columns=['one','two','three','four'])

In [3]:
data

   one  two  three  four
a    0    1      2     3
b    4    5      6     7
c    8    9     10    11

In [4]:
#Using the index map method we can assign new indexes to different values
#Suppose we want to capitalize the index names

data.index.map(str.upper)

Index(['A', 'B', 'C'], dtype='object')

In [5]:
#Now assigning it to the the index, we get
data.index = data.index.map(str.upper)

In [6]:
data

   one  two  three  four
A    0    1      2     3
B    4    5      6     7
C    8    9     10    11

In [7]:
#We can use the rename method to apply changes to the dataframe without actually modifying the actual one

data.rename(index=str.title, columns=str.upper) #Capitalizes the columns

   ONE  TWO  THREE  FOUR
A    0    1      2     3
B    4    5      6     7
C    8    9     10    11

In [9]:
#We can also use rename to modify the name of an existing label with some other one

data.rename(index={'B':'D'}, columns={'three':'five'})

   one  two  five  four
A    0    1     2     3
D    4    5     6     7
C    8    9    10    11

In [10]:
#We can modify our actual value using rename by passing inplace=True

_ = data.rename(index={'B':'D'}, columns={'three':'five'}, inplace=True)

In [11]:
data

   one  two  five  four
A    0    1     2     3
D    4    5     6     7
C    8    9    10    11